docs/physics/fluid-mechanics/brenner.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Brenner Equations of Motion</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Brenner Equations of Motion</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-4baddb89-34e8-448d-9f4e-1f424ba4ea9d">1. Introduction</a>
<ul>
<li><a href="#h-bf997a7a-7c8f-45f8-b826-c49faeb00e61">1.1. Who Cares?</a></li>
</ul>
</li>
<li><a href="#h-d9cd99c2-821f-413f-a99d-3613f2c041f6">2. References</a>
<ul>
<li><a href="#h-34c3c040-bbc0-4bf4-bb73-9c2588e6ff78">2.1. Perhaps Relevant</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-h-4baddb89-34e8-448d-9f4e-1f424ba4ea9d" class="outline-2">
<h2 id="h-4baddb89-34e8-448d-9f4e-1f424ba4ea9d"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-h-4baddb89-34e8-448d-9f4e-1f424ba4ea9d">
<p>
Howard Brenner made a fascinating observation about fluid mechanics: the
derivation of the equations of motion rely on identifying the [Eulerian]
<i>mass velocity</i> with the [Lagrangian] <i>volume velocity</i>,
despite the fact the former is kinematical whereas the latter is
dynamical. We can experimentally test this hypothesis, and Brenner <b>did</b>
that!
</p>

<ul class="org-ul">
<li>Howard Brenner,<br>
"Fluid mechanics in fluids at rest".<br>
<i>Physical Review E</i> <b>86</b>, no.1 (2012): 016307.
<a href="https://dspace.mit.edu/handle/1721.1/72460">Eprint</a></li>
</ul>

<p>
Unsurprisingly, these quantities are <i>different</i>. We end up with three
sets of equations:
</p>

<ol class="org-ol">
<li>Conservation of mass: \(\displaystyle\frac{\mathrm{D}}{\mathrm{D}t}\rho+\vec{u}_{m}\cdot\vec{\nabla}\rho=0\)</li>
<li>Euler's equations: \(\displaystyle\rho\frac{\mathrm{D}}{\mathrm{D}t}\vec{u}_{v} =-\vec{\nabla}p\)</li>
<li>Constitutive equation: \(\vec{u}_{v}-\vec{u}_{m}=K\nabla p\).</li>
</ol>

<p>
For incompressible fluids with small pressure differences, this behaves
the same as the Euler equations of motion.
</p>

<p>
<b>But</b> for compressible fluids with large pressure differences, the
behaviour is completely different.
</p>

<div class="puzzle" id="orgaf3f31a">
<p>
For modeling the atmosphere of Earth in climate models, will the Brenner
equations of motion make a significant difference?
</p>

</div>
</div>
<div id="outline-container-h-bf997a7a-7c8f-45f8-b826-c49faeb00e61" class="outline-3">
<h3 id="h-bf997a7a-7c8f-45f8-b826-c49faeb00e61"><span class="section-number-3">1.1.</span> Who Cares?</h3>
<div class="outline-text-3" id="text-h-bf997a7a-7c8f-45f8-b826-c49faeb00e61">
<p>
It turns out that these equations of motion behave more nicely than the
Euler equations of motion. Probably this carries over to the
Navier-Stokes equations. See:
</p>

<ul class="org-ul">
<li>Eduard Feireisl and Alexis Vasseur,<br>
"New perspectives in fluid dynamics: Mathematical analysis of a model
proposed by Howard Brenner."<br>
In <i>New directions in mathematical fluid mechanics, Adv. Math. Fluid Mech</i> (2009): 153-179.
<a href="https://web.ma.utexas.edu/users/vasseur/documents/preprints/feva07_01.pdf">Preprint</a>.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-h-d9cd99c2-821f-413f-a99d-3613f2c041f6" class="outline-2">
<h2 id="h-d9cd99c2-821f-413f-a99d-3613f2c041f6"><span class="section-number-2">2.</span> References</h2>
<div class="outline-text-2" id="text-h-d9cd99c2-821f-413f-a99d-3613f2c041f6">
<ul class="org-ul">
<li>Eduard Feireisl and Alexis Vasseur,<br>
"New perspectives in fluid dynamics: Mathematical analysis of a model
proposed by Howard Brenner."<br>
In <i>New directions in mathematical fluid mechanics, Adv. Math. Fluid Mech</i> (2009): 153-179.
<a href="https://web.ma.utexas.edu/users/vasseur/documents/preprints/feva07_01.pdf">Preprint</a>.</li>
<li>Howard Brenner,<br>
"Fluid mechanics in fluids at rest".<br>
<i>Physical Review E</i> <b>86</b>, no.1 (2012): 016307.
<a href="https://dspace.mit.edu/handle/1721.1/72460">Eprint</a></li>
<li>Howard Brenner, Nishanth Dongari, Jason M. Reese,<br>
"A molecular dynamics test of the Navier-Stokes-Fourier paradigm for
compressible gaseous continua".<br>
<a href="https://arxiv.org/abs/1301.1716">arXiv:1301.1716</a>, 12 pages</li>
<li>Howard Brenner,<br>
"Unsolved Problems in Fluid Mechanics".<br>
<a href="https://cbe.osu.edu/sites/default/files/uploads/brenner.pdf">PDF</a>.</li>
<li>Howard Brenner,<br>
"Beyond the no-slip boundary condition".<br>
<a href="http://hdl.handle.net/1721.1/68655">http://hdl.handle.net/1721.1/68655</a></li>
</ul>
</div>
<div id="outline-container-h-34c3c040-bbc0-4bf4-bb73-9c2588e6ff78" class="outline-3">
<h3 id="h-34c3c040-bbc0-4bf4-bb73-9c2588e6ff78"><span class="section-number-3">2.1.</span> Perhaps Relevant</h3>
<div class="outline-text-3" id="text-h-34c3c040-bbc0-4bf4-bb73-9c2588e6ff78">
<ul class="org-ul">
<li>Magnus Svärd,<br>
"A new Eulerian model for viscous and heat conducting compressible flow".<br>
<a href="https://arxiv.org/abs/1801.02468">arXiv:1801.02468</a>, 32 pages.</li>
<li>Jan Brezina,<br>
"Existence of measure-valued solutions to a complete Euler system for a perfect gas".<br>
<a href="https://arxiv.org/abs/1805.05570">arXiv:1805.05570</a>, 24 pages.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Fri, 24 Mar 2023 09:30:20 -0700
</div>
</body>
</html>
